---
kind: method
id: M:Autodesk.Revit.UI.ExternalApplicationArray.ForwardIterator
source: html/f5a92712-3b78-b4a0-6188-7e0fb9af9a84.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ExternalApplicationArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.